todbot/ArduinoCore-EFM32/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

tomu.name=Adafruit Trinket M0
tomu.vid.0=0x239A
tomu.pid.0=0x801E
tomu.vid.1=0x239A
tomu.pid.1=0x001E
tomu.upload.tool=bossac
tomu.upload.protocol=sam-ba
tomu.upload.maximum_size=262144
tomu.upload.offset=0x2000
tomu.upload.use_1200bps_touch=true
tomu.upload.wait_for_upload_port=true
tomu.upload.native_usb=true
tomu.build.mcu=cortex-m0plus
tomu.build.f_cpu=48000000L
tomu.build.usb_product="Tomu M0"
tomu.build.usb_manufacturer="todbot"
tomu.build.board=TOMU
tomu.build.core=arduino
tomu.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
tomu.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
tomu.build.openocdscript=openocd_scripts/arduino_zero.cfg
tomu.build.variant=tomu
tomu.build.variant_system_lib=
tomu.build.vid=0x239A
tomu.build.pid=0x801E
tomu.bootloader.tool=openocd
tomu.bootloader.file=trinket/bootloader_uf2.bin
